#+title:  Black-Scholes formula
#+subtitle: Finance
#+date:   2021-01-28
#+tags[]: trading options put call black-scholes volatility python

Black-Scholes formula... maybe not as important and well-known as [[/post/2020-11-24-interest-rate/][compounding interest-rate]] but still the most famous formula among options traders. Here are the formulas that you will find in financial books.

** Implementation

In Python/Sagemath it looks like this:

#+begin_src sage :session bs :results none
  from math import log, sqrt, pi, exp

  def d1(s, k, t, r, iv):
      return(log(s/k) + (r+iv**2/2)*t) / iv*sqrt(t)
  def d2(s, k, t, r, iv):
      return d1(s,k,t,r,iv) - iv*sqrt(t)

  def D(k, r, t):
      return k * exp(-r*t)
  def N(d):
      return CDF(d)

  def call_price(s, k, t, r, iv):
      return N(d1(s,k,t,r,iv)) * s - N(d2(s,k,t,r,iv)) * D(k,r,t)
  def put_price(s, k, t, r, iv):
      return N(-d2(s,k,t,r,iv)) * D(k,r,t) - N(-d1(s,k,t,r,iv)) * s
#+end_src

Call price:

#+begin_src sage :session bs :results output
  s = 1330
  k = 1280
  t = (10 + 17/24) / 365
  r = 0.01
  iv = 1.34
  print(call_price(s, k, t, r, iv))
#+end_src

#+RESULTS:
: 141.6089647684081

Put price:

#+begin_src sage :session bs :results output
  s = 33760
  k = 34000
  t = (10 + 17/24) / 365
  r = 0.01
  iv = 1.10
  print(put_price(s, k, t, r, iv))
#+end_src

#+RESULTS:
: 2655.0941969718187

** Implied volatility

We can do it the other way around as well and recursively find the implied volatility for a given price.

Call IV:

#+begin_src sage :session bs :results output
  def call_iv(p, iv=1.30, step=0.01):
      ip = call_price(s, k, t, r, iv)
      if ip > p:
          return iv;
      else:
          return call_iv(p, iv + step)

  print(call_iv(141))
#+end_src

#+RESULTS:
: 1.34000000000000

Put IV:

#+begin_src sage :session bs :results output
  def put_iv(p, iv=1.00, step=0.01):
      ip = put_price(s, k, t, r, iv)
      if ip > p:
          return iv;
      else:
          return put_iv(p, iv + step)

  print(put_iv(2660))
#+end_src

#+RESULTS:
: 1.11000000000000

